tutorials/Fracture/noCapillaryPressure/K6.7e-12U2.6Speed/0/Us
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    walls
    {
        type            $porousVelocityBC;
        value           uniform (0 0 0);
    }
    walls2
    {
        type            $porousVelocityBC;
        value           uniform (0 0 0);
    }
      upperInlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    lowerInlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    rightInlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    leftInlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
