tutorials/Fracture/noCapillaryPressure/K6.7e-12U2.6Speed/0/epss
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epss;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
196256
(
0.354854
0.362102
0.278981
0.324855
0.384131
0.379624
0.320767
0.461496
...
)
;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    walls
    {
        type            zeroGradient;
    }
    upperInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    lowerInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    rightInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    leftInlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls2
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
